<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">

<HTML>
<HEAD>
<TITLE>Obligatorisk oppgave i INF1060: Programmering i C</TITLE>

</HEAD>

<BODY >

<H1 ALIGN=CENTER>Obligatorisk oppgave i INF1060: <BR> Programmering i C</H1>

<P ALIGN=CENTER>
<STRONG>
Utlevering: 8. september 2010 
<BR>
Innlevering: 20. september 2010 før kl. 23.59
</STRONG></P>

<P>

<H1><A NAME="SECTION00010000000000000000">Intro</A></H1>

<P>
M&#229;let med denne oppgaven er &#229; f&#229; trening i C-programmering f&#248;r man begynner p&#229; hjemme-eksamenene som hovedsaklig vil v&#230;re &#229; l&#248;se programmeringsoppgaver i C. For &#229; kompilere koden skal dere lage en <TT>Makefile</TT> (see <TT>info make</TT>) slik at man bare kan skrive <TT>make</TT> i katalogen hvor filene er lagret for &#229; kompilere programmet. 
<P>

Programmet skal  kunne kjøres på IFI's standard Linux-maskiner
eller på Linux-klusteret. For å komme inn på en Linux-maskin, kan man
f.eks. kjøre <tt>ssh linux</tt>.

<P>
Denne obligatoriske oppgaven skal <I>l&#248;ses individuelt</I> og <I>m&#229; godkjennes av gruppel&#230;rer</I> f&#248;r man kan begynne p&#229; hjemme-eksamenene og g&#229; opp til avsluttende eksamen. Det er ikke lov &#229; hente kode fra annet hold eller dele egen kode med andre - all kode m&#229; v&#230;re skrevet selv. Det er derimot tillatt (og vi oppfordrer sterkt til) &#229; diskutere problemer samt &#229; utveksle informasjon og kunnskap med andre studenter, men alts&#229; ikke dele kode direkte. Se ogs&#229; p&#229; siste avsnitt om hvordan oppgaven skal leveres inn.
<P>

Det er to oppgaver som skal løses:
<UL>
<LI><A HREF="#SECTION00020000000000000000">Oppgave 1 - Tekststrenger</A></LI>
<LI><A HREF="#SECTION00030000000000000000">Oppgave 2 - Bitfikling/Kompressjon</A></LI>
</UL>

<P><BR>

<HR><H1><A NAME="SECTION00020000000000000000">Oppgave 1 - Tekststrenger</A></H1>

Denne oppgaven best&#229;r i &#229; skrive et C-program som kan leke litt med tekststrenger. Et scenario kan for eksempel v&#230;re barnesangen <I>Tre sm&#229; kinesere p&#229; H&#248;ybroplass</I> hvor man bytter vokaler. Kort sagt skal programmet kunne utf&#248;re f&#248;lgende oppgaver (i subseksjonene under er det spesifisert i mer detalj hva programmet skal gj&#248;re):
<PRE>
USAGE: ./a.out command input_file

where "command" is one of the following:

   print        print input_file
   random       print a random line
   replace      replace the vowels with all the other vowels
   remove       remove vowels
   len          print the number of characters in the input_file
</PRE> 
En eksempel fil (<I>tresmaa.txt</I>) ligger <A HREF = "./strings/">her</A>, og det er denne som er brukt i eksemplene under.

<P>

<H2><A NAME="SECTION00021000000000000000">H&#229;ndtere input-parametere</A></H2>


Som vist over skal programmet kunne ta parametere som gir instruksjoner om hva som skal gj&#248;res og hvilken tekstfil som skal brukes som input.

<P>

<H2><A NAME="SECTION00022000000000000000">Legge tekstlinjer inn i en lenket liste</A></H2>

Filen som leses inn skal legges inn i en enkelt-linket liste med et element for hver linje i filen. Hvert element i listen skal bare inneholde en 'neste'-peker og en peker til en tekststreng. F&#248;rste element i listen skal inneholde f&#248;rste linje i filen osv. Det siste som skal gj&#248;res av programmet f&#248;r det avslutter er &#229; frigj&#248;re de ressursene som er brukt i den linkede listen.

<P>

<H2><A NAME="SECTION00023000000000000000">Kommandoer</A></H2> 

De forskjellige kommandoene som skal st&#248;ttes er de f&#248;lgende:
<DL>
<DT><STRONG>print</STRONG></DT>
<DD>hvis denne kommandoen er gitt skal programmet traversere listen og skrive ut teksten linje for linje. Det vil si at man bare skriver ut hele input-filen (etter &#229; ha lagt den inn i en lenket liste). Et eksempel p&#229; utskrift kan v&#230;re:
<PRE>
paalh@linux:~/inf1060/oblig1 &gt; ./a.out print tresmaa.txt

Print text:
   Tre små kinesere på Høybroplass
   satt og spilte på en kontrabass.
   Så kom en konstabel, spurte hva var hendt,
   tre små kinesere på Høybroplass.
</PRE> 
</DD>
<DT><STRONG>random</STRONG></DT>
<DD>denne skal skrive ut en tilfeldig linje i listen. Et eksempel p&#229; utskrift kan v&#230;re:
<PRE>
paalh@linux:~/inf1060/oblig1 &gt; ./a.out random tresmaa.txt

Print a random line
   satt og spilte på en kontrabass.
</PRE> 
</DD>

<DT><STRONG>replace</STRONG></DT>
<DD>denne skal medf&#248;re at programmet g&#229;r i en l&#248;kke - en gang for hver vokal. For hver runde skal programmet sjekke tegn for tegn om det er en vokal eller ikke - hvis det er en vokal skal man bytte denne ut med den tilsvarende vokalen for denne runden. Skriv ut teksten for for hver runde. Et eksempel p&#229; utskrift kan v&#230;re:

<PRE>
paalh@linux:~/inf1060/oblig1 &gt; ./a.out replace tresmaa.txt

Replace vowels ...

... with vowel 'a'
   Tra sma kanasara pa Haabraplass
   satt ag spalta pa an kantrabass.
   Sa kam an kanstabal, sparta hva var handt,
   tra sma kanasara pa Haabraplass.

... with vowel 'e'
   Tre sme kenesere pe Heebrepless
   sett eg spelte pe en kentrebess.
   Se kem en kenstebel, sperte hve ver hendt,
   tre sme kenesere pe Heebrepless.

[...SNIP... - removed 'i', 'o', 'u', 'y' and 'æ']

... with vowel 'ø'
   Trø smø kønøsørø pø Høøbrøpløss
   søtt øg spøltø pø øn køntrøbøss.
   Sø køm øn kønstøbøl, spørtø hvø vør høndt,
   trø smø kønøsørø pø Høøbrøpløss.

... with vowel 'å'
   Trå små kånåsårå på Hååbråplåss
   sått åg spåltå på ån kåntråbåss.
   Så kåm ån kånståbål, spårtå hvå vår håndt,
   trå små kånåsårå på Hååbråplåss.
</PRE> 
</DD>

<DT><STRONG>remove</STRONG></DT>
<DD>programmet skal sjekke tegn for tegn om det er en vokal eller ikke - hvis det er en vokal skal denne fjernes (ikke byttes ut med blank) slik at det ikke skrives ut noen vokaler. Et eksempel p&#229; utskrift kan v&#230;re: 
<PRE>
paalh@linux:~/inf1060/oblig1 &gt; ./a.out remove tresmaa.txt

Remove vowels:
   Tr sm knsr p Hbrplss
   stt g splt p n kntrbss.
   S km n knstbl, sprt hv vr hndt,
   tr sm knsr p Hbrplss.
</PRE> 
</DD>

<DT><STRONG>len</STRONG></DT>
<DD>programmet skal skrive ut hvor mange tegn det er tilsammen i fila. Et eksempel p&#229; utskrift kan v&#230;re:
<PRE>
paalh@linux:~/inf1060/oblig1 &gt; ./a.out len tresmaa.txt

The text is 141 characters long
</PRE>
</DD>
</DL>

<P>

<H2><A NAME="SECTION00024000000000000000">Vedlegg</A></H2> 

Eksempelfil (<I>tresmaa.txt</I>) for denne oppgaven ligger <A HREF = "./strings/">her</A>.

<P>

<HR><H1><A NAME="SECTION00030000000000000000">Oppgave 2</A></H1>

<P>
Denne oppgaven g&#229;r ut p&#229; &#229; lage et program som opererer p&#229; bit-niv&#229;. Scenarioet er systemer som kanskje har begrenset med minne og ikke trenger s&#229; mange forskjellige tegn. Man kan da spare plass ved &#229; bytte ut den standard ASCII-representasjonen av tegnene med noe som bruker f&#230;rre bit per tegn. Vi skal i denne oppgaven anta at vi bare trenger fire forskjellige tegn, og disse kan da representeres med bare to bit hver (en byte inneholder 4 tegn):

<DIV ALIGN="CENTER">
<TABLE CELLPADDING=3 BORDER="1">

<TR><TD ALIGN="LEFT">tegn</TD><TD ALIGN="CENTER">bit-representasjon</TD></TR>

<TR><TD ALIGN="LEFT"><B>'&nbsp;&nbsp;'</B> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(blank)</TD><TD ALIGN="CENTER"><B>00</B></TD></TR>

<TR><TD ALIGN="LEFT"><B>:</B></TD><TD ALIGN="CENTER"><B>01</B></TD></TR>

<TR><TD ALIGN="LEFT"><B>@</B></TD><TD ALIGN="CENTER"><B>10</B></TD></TR>

<TR><TD ALIGN="LEFT"><B>\n</B> &nbsp;&nbsp;&nbsp;&nbsp;(linjeskift)</TD><TD ALIGN="CENTER"><B>11</B></TD></TR>

</TABLE><P>
</DIV>

Kort sagt skal programmet kunne utf&#248;re f&#248;lgende oppgaver (i subseksjonene under er det spesifisert i mer detalj hva programmet skal gj&#248;re):

<PRE>
USAGE: ./a.out command input_file output_file

where "command" is one of the following:

   p    print input_file 
        (output_file is ignored if specified)
   e    encode/compress input_file to output_file
   d    decode/uncompress and print input_file 
        (output_file is ignored if specified)
</PRE> 

<P>

<H2><A NAME="SECTION00031000000000000000">H&#229;ndtere input-parametere</A></H2>

Som vist over skal programmet kunne ta parametere som gir instruksjoner om hva som skal gj&#248;res og hvilken tekstfil som skal brukes som input og eventuelt output ved kommandoen 'e'. 
<P>

<H2><A NAME="SECTION00032000000000000000">Kommandoer</A></H2>

De forskjellige kommandoene som skal st&#248;ttes er de f&#248;lgende:
<DL>
<DT><STRONG>p</STRONG></DT>
<DD>hvis denne kommandoen er gitt skal programmet skrive ut ASCII-bildet som er lagret i input-filen.

<P>
</DD>
<DT><STRONG>e</STRONG></DT>
<DD>hvis denne kommandoen er gitt skal programmet lese inn input-filen tegn for tegn og komprimere tegnet til 2-bit-verdien beskrevet over. Verdiene skal s&#229; skrives ut igjen til output-filen (denne skal kunne leses inn igjen i dekomprimeringsoperasjonen).

<P>
</DD>
<DT><STRONG>d</STRONG></DT>
<DD>hvis denne kommandoen er gitt skal programmet lese inn input-filen som er 'komprimert' og skrive ut det orginale ASCII-bildet.
</DD>
</DL>

<P>

<H2><A NAME="SECTION00033000000000000000">Vedlegg</A></H2>

Eksempelfiler ligger <A HREF = "./compress/">her</A>. Her er  <TT>*.txt</TT> orginale tekstfiler med 8-bits ASCII-representasjon og <TT>*.compressed</TT> er ferdig komprimerte filer med 2-bits representasjon av tegnene.

<P>


<HR><H1><A NAME="SECTION00040000000000000000">Innlevering</A></H1>

<P>
Besvarelsen skal best&#229; av den <I>godt kommenterte</I> kildekoden til programmet og en makefile for kompilering. Under finner dere instruksjoner p&#229; hvordan dere skal levere inn, og <B>ved &#229; levere inn oppgaven samtykker dere p&#229; at dere overholder reglene for innleveringen.</B>

<P>

<H2><A NAME="SECTION00042000000000000000">Elektronisk innlevering</A></H2>

Oppgaven skal leveres elektronisk, dvs. at ingen papirkopi er nødvendig.
Dere skal opprette en katalog med deres <I>brukernavn som navn</I>. Denne katalogen skal inneholde alle filer som skal leveres (kode og makefile). Denne katalogen lager dere en tar-ball (<TT>tar</TT>) av og komprimerer med <TT>gzip</TT>. Tar-ballen skal navngis med brukernavnet og med postfix <TT>.tgz</TT> - for eksempel <I>paalh.tgz</I> - og laster opp som beskrevet in neste avsnitt. Se ellers <A HREF = "./tar.tgz.html">her</A> for en beskrivelse av hvordan pakke inn filene dine.

<P>

<H2><A NAME="SECTION00043000000000000000">Hvor og n&#229;r skal man levere?</A></H2>

<P>
Tidsfristen for innlevering finnes på toppen av
oppgaveteksten. Intruksjoner for hvordan man skal levere kommer om
kort tid - vi setter opp et web-grensesnitt på hjemmesiden. 

<P>

<H2><A NAME="SECTION00043100000000000000">Regler for innlevering og bruk av kode</A></H2> 

<P>
Ved alle p&#229;lagte innleveringer av oppgaver ved Ifi enten det dreier seg om obligatoriske oppgaver, hjemmeeksamen eller annet  forventes det at arbeidet er et resultat av studentens egen innsats. &#197; utgi andres arbeid for sitt eget er uetisk og kan medf&#248;re sterke reaksjoner fra Ifis side. Derfor gjelder f&#248;lgende: 

<OL>
<LI>Deling (b&#229;de i elektronisk- og papirform) eller kopiering av hele eller deler av l&#248;sningen utviklet i forbindelse med de karaktergivende oppgavene i kurset er ikke tillatt.

<P>
</LI>
<LI>Deling/distribuering av kode og oppgavetekst med personer som ikke er eksamensmeldt i inf1060 dette semesteret, med unntak av kursledelsen og gruppel&#230;rere, er ikke tillatt.

<P>
</LI>
<LI>Hente kode fra annet hold, f.eks. fra andre ``open source'' prosjekter eller kode funnet p&#229; nettet er ikke tillatt.

<P>
</LI>
<LI>Det er greit &#229; f&#229; generelle hint om hvorledes en oppgave kan l&#248;ses, men dette skal eventuelt brukes som grunnlag for egen l&#248;sning og ikke kopieres uendret inn. 

<P>
</LI>
<LI>Kursledelsen kan innkalle studenter til samtale om deres innlevering. 
</LI>
</OL>

<P>

Reglene om kopiering betyr ikke at Ifi frar&#229;der samarbeid. Tvert imot, Ifi oppfordrer studentene til &#229; utveksle faglige erfaringer om det meste. Vi oppfordrer til at studentene skal kunne l&#230;re av hverandre, men, som sagt, man skal ikke dele/distribuere/kopiere noen form for kode. Det som kreves er som nevnt at man kan st&#229; inne for det som leveres. Hvis du er i tvil om hva som er lovlig samarbeid, kan du kontakte gruppel&#230;rer eller fagl&#230;rer.

<P>

Se ellers IFIs <A HREF = "http://www.ifi.uio.no/studier/skjemaer/oblig-retningslinjer.pdf">retningslinjer</A> 

<P>
<BR>

<PRE>
Lykke til!
    Michael, Kjell Åge og Pål
</PRE>
</BODY>
</HTML>
